docs/recipes/roast-carrot-lentil-curry-bowls.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Roast Carrot Lentil Curry Bowls</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="static/spoon.ico" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Roast Carrot Lentil Curry Bowls</h1>
<p>
<a href="http://pinchofyum.com/lentil-curry-bowls-with-cilantro-cashew-sauce%20">Original link</a>
</p>

<div id="outline-container-org9e32ab5" class="outline-2">
<h2 id="org9e32ab5">Ingredients</h2>
<div class="outline-text-2" id="text-org9e32ab5">
</div>
<div id="outline-container-orgc6888d7" class="outline-3">
<h3 id="orgc6888d7">For the Cilantro Cashew Sauce:</h3>
<div class="outline-text-3" id="text-orgc6888d7">
<ul class="org-ul">
<li>1/2 cup fresh cilantro</li>
<li>3/4 cup cashews (mine were salted)</li>
<li>? cup water</li>
<li>1/4 teaspoon salt</li>
<li>juice of 2 limes</li>
<li>1 clove garlic (optional)</li>
<li>1-2 teaspoons honey</li>
</ul>
</div>
</div>

<div id="outline-container-orga7aecab" class="outline-3">
<h3 id="orga7aecab">For the Roasted Carrots:</h3>
<div class="outline-text-3" id="text-orga7aecab">
<ul class="org-ul">
<li>8-10 carrots, peeled and chopped into chunks</li>
<li>1 tablespoon olive oil</li>
<li>1 teaspoon garam masala</li>
<li>1/2 teaspoon chili powder</li>
<li>salt to taste</li>
</ul>
</div>
</div>

<div id="outline-container-org6d93a8d" class="outline-3">
<h3 id="org6d93a8d">For the Rice and Lentil Curry:</h3>
<div class="outline-text-3" id="text-org6d93a8d">
<ul class="org-ul">
<li>1 cup basmati rice</li>
<li>1 tablespoon oil</li>
<li>1/2 cup chopped onion</li>
<li>2 cloves garlic</li>
<li>2 tablespoons red Thai curry paste</li>
<li>1 teaspoon garam masala</li>
<li>1/2 teaspoon cumin seed (or ground cumin)</li>
<li>1 cup brown lentils, rinsed</li>
<li>400 g tomato puree (passata)</li>
<li>2 cups chicken or vegetable broth</li>
<li>pinch of salt</li>
<li>avocado and cilantro for topping</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0807125" class="outline-2">
<h2 id="org0807125">Instructions</h2>
<div class="outline-text-2" id="text-org0807125">
<ol class="org-ol">
<li>For the sauce, puree all ingredients in a food processor or blender until smooth. Taste and adjust.</li>
<li>For the carrots, toss all ingredients together. Roast at 450 degrees for 20-30 minutes or until golden brown and roasty. &lt;&#x2013; favorite word.</li>
<li>Cook the rice according to package directions. I used a rice cooker.</li>
<li>For the curry, heat the oil in a skillet over medium heat. Add the onion and garlic; saute for 3-5 minutes. Add the curry paste and spices; saute for 2-3 minutes.</li>
<li>Add the lentils, tomato sauce, and broth. Simmer until lots of the liquid has evaporated - continue adding ½ cup of liquid as needed (the lentils will just keep soaking it up). Repeat this process for about 30-45 minutes until the lentils are soft.</li>
<li>Add the rice to the lentil mixture; stir to combine, adding extra broth or water as necessary. Season with salt.</li>
<li>Serve in bowls topped with the roasted carrots, avocado slices, cilantro, and cilantro cashew dressing.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
